## 행 인덱스/열 이름 설정

In [62]:
import pandas as pd

df = pd.DataFrame([[15,'남','덩영중'], [17,'여','수리중']])
print(df)
# 한번에 변경 
df.index = ['학생1', '학생2']
df.columns = ['연령','남녀','소속']
print(df)

    0  1    2
0  15  남  덩영중
1  17  여  수리중
     연령 남녀   소속
학생1  15  남  덩영중
학생2  17  여  수리중

In [63]:
# 특정 열 이름만 변경
df.rename(index={'학생1':'남중딩'}, inplace = True)
df = df.rename(columns={'연령':'나이'})
df

     나이 남녀   소속
남중딩  15  남  덩영중
학생2  17  여  수리중

In [66]:
# 복제
df1 = df
print(df1)
df2 = df[:]
print(df2)

     나이 남녀   소속
남중딩  15  남  덩영중
학생2  17  여  수리중
     나이 남녀   소속
남중딩  15  남  덩영중
학생2  17  여  수리중

In [67]:
df2 = df2.drop(['남중딩'],axis=0)
df2

     나이 남녀   소속
학생2  17  여  수리중

### 행 선택

In [68]:
df1.loc["남중딩"]

나이     15
남녀      남
소속    덩영중
Name: 남중딩, dtype: object

In [69]:
df1.iloc[0]

나이     15
남녀      남
소속    덩영중
Name: 남중딩, dtype: object

## 원소 선택

In [70]:
df1

     나이 남녀   소속
남중딩  15  남  덩영중
학생2  17  여  수리중

In [71]:
df1.loc['남중딩', '남녀']

'남'

In [72]:
df1.iloc[0,1]

'남'

## 행 인덱스 재배열  
DataFrame.reindex(새로운 인덱스 배열)  
DataFrame.reset_index(): 행 인덱스를 정수형으로 초기화  
DataFrame.sort_index(): 인덱스 오름차순으로 정렬  
DataFrame.sort_values(by = 'c1', ascending=False)

## 시리즈는 연산(+, -, *, /) + 숫자 가능  
단, nan과 연산시 결과는 nan

## 웹 스크래핑(트랜스 마켓)

In [114]:
import requests
from bs4 import BeautifulSoup
import pandas as pd
import time

headers = {'User-Agent':'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/91.0.4472.77 Safari/537.36'}

number = []
name = []
position = []
age = []
nation = []
team = []
value = []

url = "https://www.transfermarkt.com/marktwertetop/wertvollstespieler?ajax=yw1&page=1"
r  = requests.get(url,headers=headers)
soup = BeautifulSoup(r.text,'html.parser')
player_info = soup.find_all('tr',class_=['odd','even'])



for info in player_info:
    player = info.find_all('td')
    number.append(player[0].text)
    name.append(player[3].text)
    position.append(player[4].text)
    age.append(player[5].text)
    nation.append(player[6].img['alt']) 
    team.append(player[7].img['alt'])
    value.append(player[8].text.strip())

time.sleep(1)

df = pd.DataFrame(
        {"number":number,
        "name":name,
        "position":position,
        "age":age,
        "nation":nation,
        "team":team,
        "value":value,
        }
    )
df.head()

,number,name,position,age,nation,team,value
0,1,Kylian Mbappé,Centre-Forward,22,France,Paris Saint-Germain,€160.00m
1,2,Erling Haaland,Centre-Forward,20,Norway,Borussia Dortmund,€130.00m
2,3,Harry Kane,Centre-Forward,27,England,Tottenham Hotspur,€120.00m
3,4,Jadon Sancho,Right Winger,21,England,Borussia Dortmund,€100.00m
4,5,Mohamed Salah,Right Winger,29,Egypt,Liverpool FC,€100.00m

In [115]:
df = df.set_index('number')
df.head()

,name,position,age,nation,team,value
number,,,,,,
1,Kylian Mbappé,Centre-Forward,22,France,Paris Saint-Germain,€160.00m
2,Erling Haaland,Centre-Forward,20,Norway,Borussia Dortmund,€130.00m
3,Harry Kane,Centre-Forward,27,England,Tottenham Hotspur,€120.00m
4,Jadon Sancho,Right Winger,21,England,Borussia Dortmund,€100.00m
5,Mohamed Salah,Right Winger,29,Egypt,Liverpool FC,€100.00m